# Sources
tap 'traktuner/traktuner'

# Utilities
brew 'mas'
brew 'git'
brew 'mackup'
brew 'tailscale'

# Apps from "Web"
cask 'warp'
cask 'firefox'
cask 'eloston-chromium', args: { no_quarantine: true }
cask 'protonvpn'
cask 'proton-mail'
cask 'proton-drive'
cask 'proton-pass'
cask 'standard-notes'
cask 'synology-drive'
cask 'visual-studio-code'
cask 'darktable', args: { no_quarantine: true }
cask 'affinity-photo'
cask 'affinity-designer'
cask 'affinity-publisher'
cask 'vlc'
cask 'topaz-video-ai'
cask 'beeper'
cask 'cryptomator'
cask 'appcleaner'
cask 'crossover'
cask 'steam'
cask 'xemu', args: { no_quarantine: true }
cask 'spotify'
cask 'keepingyouawake'
cask 'shottr'
cask 'bartender'
cask 'daisydisk'
cask 'betterzip'
cask 'handbrake'
cask 'utm'
cask 'mist'
cask 'crashplan'
cask 'microsoft-defender'
cask 'little-snitch'
cask 'network-share-mounter'
cask 'cleanmymac'

# Apps for Work
cask 'microsoft-word'
cask 'microsoft-excel'
cask 'microsoft-teams'
cask 'cisco-jabber'
cask 'webex'
cask 'citrix-workspace'

# Apps from the App Store
mas 'Logic Pro', id: 634148309
mas 'Pixelmator Pro', id: 1289583905
mas 'Vivid', id: 6443470555
mas 'CEWE Fotoservice', id: 1446275768
mas 'HP Smart', id: 1474276998
mas 'Speedtest', id: 1153157709

# Extensions
mas '1Blocker', id: 1365531024
mas 'StopTheMadness Pro', id: 6471380298
mas 'Noir', id: 1592917505
mas 'Wayback Machine', id: 1472432422
mas 'Proton Pass for Safari', id: 6502835663
